In [6]:
import numpy as np
import pandas as pd

# Creating a series

In [31]:
lables=['a','b','c','d']
my_list=[10,20,30]
arr=np.array([10,20,30,79])
d={'a':40,'b':50,'c':60}

In [10]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [32]:
pd.Series(data=arr)

0    10
1    20
2    30
3    79
dtype: int32

In [33]:
pd.Series(arr,lables)

a    10
b    20
c    30
d    79
dtype: int32

In [19]:
pd.Series(data=d,index=lables)

a    40.0
b    50.0
c    60.0
d     NaN
dtype: float64

In [34]:
ser1=pd.Series([1,2,3,4],index=['usa','germany','uk','japan'])

In [36]:
ser1

usa        1
germany    2
uk         3
japan      4
dtype: int64

In [38]:
ser2=pd.Series([1,2,3,4,5],index=['USA','Germany','India','AUS','BHU'])

In [39]:
ser2

USA        1
Germany    2
India      3
AUS        4
BHU        5
dtype: int64

In [40]:
ser1+ser2

AUS       NaN
BHU       NaN
Germany   NaN
India     NaN
USA       NaN
germany   NaN
japan     NaN
uk        NaN
usa       NaN
dtype: float64

In [43]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [53]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [56]:
df1=pd.DataFrame(randn(6,5), index='G H J K L M'.split(),columns='O N C V K'.split())

In [57]:
df1

          O         N         C         V         K
G  0.586847 -1.621348  0.677535  0.026105 -1.678284
H  0.333973 -0.532471  2.117727  0.197524  2.302987
J  0.729024 -0.863091  0.305632  0.243178  0.864165
K -1.560931 -0.251897 -0.578120  0.236996  0.200780
L  0.327845  0.674485 -0.174057  0.780140 -0.383258
M -0.409318  0.343539  0.196275 -0.982776  2.231555

In [76]:
df1['new'] = df1['V']+df1['N']

In [78]:
df1

          O         N         C         V         K       new
G  0.586847 -1.621348  0.677535  0.026105 -1.678284 -1.595242
H  0.333973 -0.532471  2.117727  0.197524  2.302987 -0.334947
J  0.729024 -0.863091  0.305632  0.243178  0.864165 -0.619914
K -1.560931 -0.251897 -0.578120  0.236996  0.200780 -0.014901
L  0.327845  0.674485 -0.174057  0.780140 -0.383258  1.454625
M -0.409318  0.343539  0.196275 -0.982776  2.231555 -0.639237

In [81]:
df1.drop('new', axis=1)

          O         N         C         V         K
G  0.586847 -1.621348  0.677535  0.026105 -1.678284
H  0.333973 -0.532471  2.117727  0.197524  2.302987
J  0.729024 -0.863091  0.305632  0.243178  0.864165
K -1.560931 -0.251897 -0.578120  0.236996  0.200780
L  0.327845  0.674485 -0.174057  0.780140 -0.383258
M -0.409318  0.343539  0.196275 -0.982776  2.231555

In [83]:
df1.drop('new', axis=1,inplace=True)

In [84]:
df1

          O         N         C         V         K
G  0.586847 -1.621348  0.677535  0.026105 -1.678284
H  0.333973 -0.532471  2.117727  0.197524  2.302987
J  0.729024 -0.863091  0.305632  0.243178  0.864165
K -1.560931 -0.251897 -0.578120  0.236996  0.200780
L  0.327845  0.674485 -0.174057  0.780140 -0.383258
M -0.409318  0.343539  0.196275 -0.982776  2.231555

In [87]:
df1.drop('M',axis=0)

          O         N         C         V         K
G  0.586847 -1.621348  0.677535  0.026105 -1.678284
H  0.333973 -0.532471  2.117727  0.197524  2.302987
J  0.729024 -0.863091  0.305632  0.243178  0.864165
K -1.560931 -0.251897 -0.578120  0.236996  0.200780
L  0.327845  0.674485 -0.174057  0.780140 -0.383258

In [92]:
df1.loc[['G','H','J']]

          O         N         C         V         K
G  0.586847 -1.621348  0.677535  0.026105 -1.678284
H  0.333973 -0.532471  2.117727  0.197524  2.302987
J  0.729024 -0.863091  0.305632  0.243178  0.864165

In [95]:
df1.iloc[1]

O    0.333973
N   -0.532471
C    2.117727
V    0.197524
K    2.302987
Name: H, dtype: float64

In [99]:
df1.loc[['G','H'],['O','V']]

          O         V
G  0.586847  0.026105
H  0.333973  0.197524

In [100]:
df1>0

       O      N      C      V      K
G   True  False   True   True  False
H   True  False   True   True   True
J   True  False   True   True   True
K  False  False  False   True   True
L   True   True  False   True  False
M  False   True   True  False   True

In [101]:
df1[df1>0]

          O         N         C         V         K
G  0.586847       NaN  0.677535  0.026105       NaN
H  0.333973       NaN  2.117727  0.197524  2.302987
J  0.729024       NaN  0.305632  0.243178  0.864165
K       NaN       NaN       NaN  0.236996  0.200780
L  0.327845  0.674485       NaN  0.780140       NaN
M       NaN  0.343539  0.196275       NaN  2.231555

In [107]:
df1[df1['N']>0]

          O         N         C         V         K
L  0.327845  0.674485 -0.174057  0.780140 -0.383258
M -0.409318  0.343539  0.196275 -0.982776  2.231555

In [109]:
df1[df1['V']>0]['K']

G   -1.678284
H    2.302987
J    0.864165
K    0.200780
L   -0.383258
Name: K, dtype: float64

In [110]:
df1[df1['O']>0][['C','K']]

          C         K
G  0.677535 -1.678284
H  2.117727  2.302987
J  0.305632  0.864165
L -0.174057 -0.383258

In [115]:
df1[(df1['N']>0) | (df1['V']>1)]

          O         N         C         V         K
L  0.327845  0.674485 -0.174057  0.780140 -0.383258
M -0.409318  0.343539  0.196275 -0.982776  2.231555

In [117]:
df1

          O         N         C         V         K
G  0.586847 -1.621348  0.677535  0.026105 -1.678284
H  0.333973 -0.532471  2.117727  0.197524  2.302987
J  0.729024 -0.863091  0.305632  0.243178  0.864165
K -1.560931 -0.251897 -0.578120  0.236996  0.200780
L  0.327845  0.674485 -0.174057  0.780140 -0.383258
M -0.409318  0.343539  0.196275 -0.982776  2.231555

In [122]:
df1.reset_index()

  index         O         N         C         V         K
0     G  0.586847 -1.621348  0.677535  0.026105 -1.678284
1     H  0.333973 -0.532471  2.117727  0.197524  2.302987
2     J  0.729024 -0.863091  0.305632  0.243178  0.864165
3     K -1.560931 -0.251897 -0.578120  0.236996  0.200780
4     L  0.327845  0.674485 -0.174057  0.780140 -0.383258
5     M -0.409318  0.343539  0.196275 -0.982776  2.231555

In [126]:
newind = 'CA NY WY OR CO NA'.split()

In [127]:
newind

['CA', 'NY', 'WY', 'OR', 'CO', 'NA']

In [128]:
df1["states"]= newind

In [129]:
df1

          O         N         C         V         K states
G  0.586847 -1.621348  0.677535  0.026105 -1.678284     CA
H  0.333973 -0.532471  2.117727  0.197524  2.302987     NY
J  0.729024 -0.863091  0.305632  0.243178  0.864165     WY
K -1.560931 -0.251897 -0.578120  0.236996  0.200780     OR
L  0.327845  0.674485 -0.174057  0.780140 -0.383258     CO
M -0.409318  0.343539  0.196275 -0.982776  2.231555     NA

In [133]:
df.set_index('States',inplace=True)

KeyError: "None of ['States'] are in the columns"

In [131]:
df1.set_index('states')

               O         N         C         V         K
states
CA      0.586847 -1.621348  0.677535  0.026105 -1.678284
NY      0.333973 -0.532471  2.117727  0.197524  2.302987
WY      0.729024 -0.863091  0.305632  0.243178  0.864165
OR     -1.560931 -0.251897 -0.578120  0.236996  0.200780
CO      0.327845  0.674485 -0.174057  0.780140 -0.383258
NA     -0.409318  0.343539  0.196275 -0.982776  2.231555

In [132]:
df.set_index('States',inplace=True)

KeyError: "None of ['States'] are in the columns"

In [134]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [135]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [142]:
bf=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [146]:
bf

             A         B
G1 1 -1.097693 -1.908009
   2 -0.380104 -1.666059
   3 -2.736995  1.522562
G2 1  0.178009 -0.626805
   2 -0.391089  1.743477
   3  1.130018  0.897796

In [148]:
bf.loc['G1']

          A         B
1 -1.097693 -1.908009
2 -0.380104 -1.666059
3 -2.736995  1.522562

In [150]:
bf.loc['G1'].loc[2]

A   -0.380104
B   -1.666059
Name: 2, dtype: float64

In [151]:
bf.index.names

FrozenList([None, None])

In [157]:
bf.index.names=['Group','Num']

In [158]:
bf

                  A         B
Group Num
G1    1   -1.097693 -1.908009
      2   -0.380104 -1.666059
      3   -2.736995  1.522562
G2    1    0.178009 -0.626805
      2   -0.391089  1.743477
      3    1.130018  0.897796

In [159]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [160]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [161]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [165]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [166]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [169]:
df.fillna(value='20')

     A    B  C
0  1.0  5.0  1
1  2.0   20  2
2   20   20  3

In [170]:
df.fillna(value='mean')

      A     B  C
0   1.0   5.0  1
1   2.0  mean  2
2  mean  mean  3

In [181]:
df[['A','B']].fillna(value=df[['A','B']].mode())

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  NaN